{"2": ["Noremac", ["\nScreenshot_20181028-183705.jpg1080x1920 466 KB\n\n\nScreenshot_20181028-185232.jpg1080x1920 512 KB\n"]], "5": ["Noremac", ["|transfer|100|MTF_NineTailedFox| Because I can and for test purposes."]], "9": ["Noremac", ["|deposit|10000|Centurion1|"]], "6": ["Noremac", ["|transfer|100|TheHorseLord|\n@TheHorseLord Tithes for my Lord."]], "1": ["Noremac", ["Welcome, soldiers of fortune, to the Samurai Bank. Here you can exchange victory screenshots for gold, silver, and copper. This currency can be hoarded, traded, or used in any way you can imagine. In the future I hope to create more ways to spend money in Samurai Wars. For now the main purpose of is to show who is the best. Only those generals who play often and consistently win can acquire the most wealth.", "One gold is equal to ten silver. One silver is equal to ten copper. The worth of each screenshot will be determined by the types of surviving units. With this update there will be some changes.", "Victory screenshots containing a surviving general are worth 1 gold.", "Victory screenshots containing no surviving general are worth 5 silver.", "There one notable difference with this update. I have create a discord bot that will keep track of deposits and transfers that are posted in this thread. The bot can only handle deposits and transfers for now, but more features will be updated in the future.", "In order to transfer money on the forum you can use the following command:", "|transfer|amount|player|", "For example if I type:\n|transfer|123|MTF_NineTailedFox|", "1 gold, 2 silver, and 3 copper will be automatically transferred from my account to NineTaiedFox’s account.", "Currently, as before, I will be the only one verifying deposits. The good thing and main reason behind this new system is that it is possible for other players to be given deposit privileges. Players who are interested in taking on this role can talk to me about it and start training to become a banker.", "In order to view the account balances you will have to go over to the main Samurai Wars discord server and type “|accounts” without the quotation marks.", "Step up your game with a modern voice & text chat app. Crystal clear voice, multiple server and channel support, mobile apps, and more. Get your free server now!", "Here is a full list of discord commands currently available to you:", "|accounts", "This shows the full account list", "|show “player name”", "This shows the account balance of a certain player. The player name is exactly as it is listed on the forum without quotation marks. For example |show Noremac", "|ATM", "This command will update the account list with deposits or transfers made on the forum. Please do not overuse this command because it may slow down the forum.", "I have only recently made this bot so there may be some bugs, and it is certainly not as streamlined as it could be. If this gets some use I will certainly make future updates. If any of this is confusing to anybody feel free to ask questions here or ping me on discord. Lastly, please keep all banking bot activities in the bank channel in the discord."]], "pNum": "9", "8": ["Noremac", ["Find a victory screen shot somewhere and see how it works. I have the same problem, though."]], "4": ["Noremac", ["|deposit|200|Noremac|"]], "7": ["BOOM407", ["Love 2 get involved, don’t play as often as I would like 2 tho."]]}